UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ЧекККМ/ЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="07771644-d1a4-4837-b089-39d71440331e">
  <name>ЧекККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="ae882be7-c0ea-4171-9749-9e733683f585">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5868db51-ee6e-4dc2-8099-a6895fdb0a23">
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6be7ba55-3dee-46a9-9066-3923a1c05e4e">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="335430dd-d274-4cfc-b21f-f6590d358a51">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="449453b0-3815-4b25-8df5-2ddc3c04cc95">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="270d676c-b547-481b-bacc-d6c7718225d1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3f4ca831-2784-42c1-8a50-5d7835d558d4">
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d943cd06-df5b-4950-a40e-f2405cf234f2">
      <name>СуммаСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8b1124a7-bf66-49a5-ae13-e8e4652c0ca5">
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b47e9952-fe7b-47b1-96dc-dc43b11dd35a">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="79d86a6b-ff8c-4102-8718-9bffffaa4a2a">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="bc5c05fd-148b-4699-ac12-db7c3796b6c4">
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="be7b914a-e316-478b-89e9-659184622424">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5fa61ae4-e073-4e5b-8abb-6319349df8aa">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_НастройкаЛогистики/саУНФ_НастройкаЛогистики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_НастройкаЛогистики</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>Boolean</types>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>String</types>
      <types>CatalogRef.КассыККМ</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Documents/ЧекККМ/ObjectModule.bsl
Функция ПолучитьКассуЛогистики()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	саУНФ_НастройкаЛогистики.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.саУНФ_НастройкаЛогистики КАК саУНФ_НастройкаЛогистики
		|ГДЕ
		|	саУНФ_НастройкаЛогистики.Параметр = ""Касса""";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий() ;
      	Возврат  Выборка.Значение;
	Иначе
		Касса = Справочники.КассыККМ.НайтиПоКоду("000000165");
	    Если Касса = Справочники.КассыККМ.ПустаяСсылка() Тогда
		       Возврат Неопределено;
		Иначе	
		       Возврат Касса;
		КонецЕсли;
	КонецЕсли; 
			
КонецФункции // ()
 


&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	  Если ЗначениеЗаполнено(Заказ) Тогда
		      УстановитьПривилегированныйРежим(Истина);
		      Касса =  ПолучитьКассуЛогистики();
			  Если ПривилегированныйРежим() Тогда
			          УстановитьПривилегированныйРежим(Ложь);
			  КонецЕсли; 
			  
			  Если  Не Касса = Неопределено И Касса = КассаККМ Тогда
			            Ответственный = Заказ.Ответственный;
			  КонецЕсли; 
	//***Начало***08.02.2022***МурашкоВ
	ОМ= ОбщегоНазначения.ОбщийМодуль("саУНФ_РаботаСОМА");
	Если  НЕ ОМ=Неопределено Тогда
		СписокНастроек = ОМ.ПолучитьСтруктураНастроекОМА();
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказПокупателя") 
			И Заказ.ВидЗаказа =СписокНастроек.ВидЗаказаОМА Тогда
			КоллекцияСтрок1 = Заказ.Запасы.Выгрузить(,"Номенклатура,Партия,Количество");
			КоллекцияСтрок2 = Запасы.Выгрузить(,"Номенклатура,Партия,Количество");
			Результат = ОбщегоНазначения.КоллекцииИдентичны(КоллекцияСтрок1, КоллекцияСтрок2);
			Если  Не Результат Тогда
				СтатусЗаказа = СписокНастроек.СостояниеЧастичныйВозврат;
			Иначе	
				СтатусЗаказа = Справочники.СостоянияЗаказовПокупателей.Завершен;
			КонецЕсли; 
			Если  НЕ Заказ.СостояниеЗаказа =СтатусЗаказа  Тогда
				
				ЗаказОбъект=Заказ.ПолучитьОбъект();
				ЗаказОбъект.СостояниеЗаказа = СтатусЗаказа; 
				Попытка
					ЗаказОбъект.Записать();
				Исключение
					ОбщегоНазначения.СообщитьПользователю("Не удалось изменить статус заказа "+Строка(Заказ));
				КонецПопытки;  	
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;

	//***Конец***08.02.2022***МурашкоВ		  
			  
			  
		 КонецЕсли; 
	
КонецПроцедуры
